from PyQt5.QtCore import QTime

win_x, win_y = 200, 100
win_width, win_height = 1000, 600

txt_hello = "Ласкаво просимо до програми визначення стану здоров'я!"
txt_next = 'Почати'



txt_title = "Здоров'я"
txt_name = 'Введіть П.І.Б.:'
txt_hintname = "П.І.Б."
txt_hintage = "0"
txt_test1 = 'Ляжте на спину і заміряйте пульс за 15 секунд. Натисніть кнопку "Почати перший тест", щоб запустити таймер.\nРезультат запишіть у відповідне поле.'
txt_test2 = 'Виконайте 30 присідань за 45 секунд. Для цього натисніть кнопку "Почати робити присідання", щоб запустити лічильник присідань.'
txt_test3 = 'Лягте на спину і заміряйте пульс спочатку за перші 15 секунд хвилини, потім за останні 15 секунд. хвилини без виміру пульсацій. Результати запишіть у відповідні поля.'
txt_sendresults = 'Надіслати результати'
txt_hinttest1 = '0'
txt_hinttest2 = '0'
txt_hinttest3 = '0'
txt_starttest1 = 'Почати перший тест'
txt_starttest2 = 'Почати робити присідання'
txt_starttest3 = 'Почати фінальний тест'
time = QTime(0, 0, 15)
txt_timer = time.toString("hh:mm:ss")
txt_age = 'Повних років:'
txt_finalwin = 'Результати'
txt_index = "Індекс Рут'є: "
txt_workheart = 'Працездатність серця: '
txt_res1 = "низька. Терміново зверніться до лікаря!"
txt_res2 = "задовільна. Зверніться до лікаря!"
txt_res3 = "середня. Можливо, варто додатково обстежитись у лікаря."
txt_res4 = "вище середнього"
txt_res5 = "висока"
